# Naive Bayes Classifier Algorithm

In [182]:
import pandas as pd 
import numpy as np

In [183]:
df = pd.read_csv(r'C:\Users\OM\program by om unde\Machine Learning Practice\Datasets\titanic.csv')

In [184]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

# Data Exploration

In [185]:
df.drop(['PassengerId','Name','Parch','Ticket','Cabin','Embarked'],axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age  SibSp     Fare  Survived
0       3    male  22.0      1   7.2500         0
1       1  female  38.0      1  71.2833         1
2       3  female  26.0      0   7.9250         1
3       1  female  35.0      1  53.1000         1
4       3    male  35.0      0   8.0500         0

In [186]:
target = df.Survived
inputs=df.drop('Survived',axis='columns')

In [187]:
inputs

     Pclass     Sex   Age  SibSp     Fare
0         3    male  22.0      1   7.2500
1         1  female  38.0      1  71.2833
2         3  female  26.0      0   7.9250
3         1  female  35.0      1  53.1000
4         3    male  35.0      0   8.0500
..      ...     ...   ...    ...      ...
886       2    male  27.0      0  13.0000
887       1  female  19.0      0  30.0000
888       3  female   NaN      1  23.4500
889       1    male  26.0      0  30.0000
890       3    male  32.0      0   7.7500

[891 rows x 5 columns]

In [188]:
# So here we converted sex column into two different columns
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [189]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age  SibSp     Fare
0       3  22.0      1   7.2500
1       1  38.0      1  71.2833
2       3  26.0      0   7.9250
3       1  35.0      1  53.1000
4       3  35.0      0   8.0500

In [190]:
# This command is used to check the specific columns who has null value's
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [191]:
df['Age'].isnull().sum()

177

In [192]:
# So here we replaced the null value with the 'mean of Age'
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [193]:
# U can see the index row 6 was having null value and it is replaced with mean of Age
inputs.head(6)

   Pclass        Age  SibSp     Fare
0       3  22.000000      1   7.2500
1       1  38.000000      1  71.2833
2       3  26.000000      0   7.9250
3       1  35.000000      1  53.1000
4       3  35.000000      0   8.0500
5       3  29.699118      0   8.4583

# Now we split the dataset into training and testing dataset

In [194]:
from sklearn.model_selection import train_test_split

In [195]:
x_train, x_test, y_train, y_test= train_test_split(inputs,target,test_size=0.2)

In [196]:
x_train.shape

(712, 4)

In [197]:
x_test.shape

(179, 4)

In [198]:
inputs.shape

(891, 4)

# Create Naive Bayes Model Here

In [199]:
# Import naive bayes from sklearn
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [200]:
model.fit(x_train,y_train)

GaussianNB()

In [201]:
model.score(x_test,y_test)

0.7150837988826816

# Classification of Spam Email Detection Dataset